package com.wisdom.framework.core.bean;

/**
 * @author hyberbin on 2017/1/11.
 */
public enum LogTypeEnum {


    系统错误(5000),
    用户登录(2000),
    BCG调用(3000),
    添加银行机构(1010),
    修改银行机构(1020),
    删除银行机构(1030),
    快捷支付(3010),
    网银支付(3020),
    扫码支付(3021),
    网银重定向(3030),
    代付(3040),
    查询服务(3050),
    退款服务(3060),
    银行回调(3070),
    前端回调(3080),
    KV后台通知(3090),
    导出提现流水(4000),
    提现(3100),
    添加商户(5010),
    修改商户(5020),
    删除商户(5030),
    添加商户操作员(6010),
    修改操作员信息(6020),
    修改操作员密码(6040),
    删除操作员(6030),
    添加商户渠道银行(7010),
    删除商户渠道银行(7030),
    批量添加商户渠道银行(7040),
    导出代付流水(8010),
    手动置订单失败(8030),
    导出支付流水(8020),
    代付充值(3110),
    查询补单(3120),
    手动退款(3130),
    商户注册(9010),
    添加渠道银行(10010),
    修改渠道银行(10020),
    删除渠道银行(10030),
    批量添加渠道银行(10040),
    添加路由机构(11010),
    修改路由机构(11020),
    删除路由机构(11030),
    添加角色(12010),
    修改角色(12020),
    删除角色(12030),
    添加提现卡(13010),
    修改提现卡(13020),
    单个采集(14010),
    批量采集(14020);

    int logType;
    LogTypeEnum(int i) {
        this.logType=i;
    }

    public int getLogType() {
        return logType;
    }
}
